
#
# 1.  Роздрукувати всі парні числа менші 100 (написати два варіанти коду: один використовуючи цикл while, а інший з використанням циклу for).

# task1
# for i in range(0, 99, 2):
#     print(i)

# task2
# a = 2
# while a < 100:
#     print(a)
#     a += 2



# 2.  Роздрукувати всі непарні числа менші 100. (написати два варіанти коду:
# один використовуючи оператор continue, а інший без цього оператора).

# task2/1
# for i in range(1, 99, 2):
#     print(i)

# task2/1
# for i in range(1, 99, 2):
#     print(i)
#     continue

# пробуємо з while
# a = 0
# while a < 100:
#     if a % 2 == 0:
#         a += 1
#         continue
#     else:
#         'is not true'
#
# таск для себе
# i = 0
# for i in range(2, 100, 2):
#     print(i)
#

# 3.  Перевірити чи список містить непарні числа.
#           (Підказка: використати оператор break)

#пробую з while
# a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#
# while a % 2 == 0:
#     print('непане число')
#     break
# else:
#     print('is not парні numbers')


# пробую з for
# a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# for i in a:
#     if i % 2 == 1:
#         print('непарне число є')
#         break
#     else:
#         print('немає непарних чисел')

# 4.  Створити список, який містить елементи цілочисельного типу,
# потім за допомогою циклу перебору змінити тип даних елементів на числа з
# плаваючою крапкою.
# (Підказка: використати вбудовану функцію float ()).


# a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# for i in a:
#    float(i)
#    print(a)

# 5.  Вивести числа Фібоначі включно до введеного числа n, використовуючи
# цикли.
# (Послідовність чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)

n1 = 0
n2 = 1
i = 0
while i < 10:
    print(n1)
    n3 = n1 + n2
    n1 = n2
    n2 = n3
    i += 1


# 6.  Створити список, що складається з чотирьох елементів типу string.
# Потім, за допомогою циклу for, вивести елементи по черзі на екран.


# a = ['1', '2', '3', '4']
# for i in a:
#     print(i)






